clear all;
clc;
close all;
%關所有的圖

%(1)針對上次的成績單原始分數作曲線圖(x軸是流水號或excel的列號或學號，y軸是分數)及

x2 = [1
2
3
44
5
62
7
8
9
10
113
12
13
143
15
16
173
18
19
20
21
223
23
24
25
26
27
28
292
30
31
32
33
344
35
36
37
38
39
404
41
42
432
44
453
46
47
48
49
50];
%亦可寫做x2 = [343 1423 3423 54 231 43 554];
score = [12
18
24
30
36
42
48
54
60
66
72
78
84
90
96
15
19
23
27
31
35
39
43
47
51
55
59
63
67
71
75
79
83
87
91
95
99
47
49
51
53
55
57
59
61
63
65
67
69
71];
figure(1),plot(x2,score,'r','MarkerSize',20);
title('排序前');
[x3,I] = sort(x2);
figure(2),plot(x3,score,'r','MarkerSize',20);
title('排序後');

%(2)請計算自定義的數學方程式的函數(必須含有指數e, n次分)的某一點斜率，並由作圖來說明你心目
%中的答案是合理的，

f = @(x) exp(-x^2); 
%指數 ^為次方 此為f(x)=e(-x^2)程式碼
k = 0;
%當作slope之索引值
for i = 2:1:10
    %i至x為繪製x點
    k = k+1;
    h = 10^(-i);
    %h盡量小 趨近於0
    delta_y = f(2+h)-f(2);
    %delta_y=f(x+h)-f(x)=f(2+h)-f(2)
    delta_x = h;
    slope(k) = delta_y/delta_x;
    %斜率計算
end
figure,plot(2:1:10,slope)

%(3)請使用任何畫圖工具(例如: 小畫家)作畫或下載沒有版權的彩圖或灰階圖，並用matlab畫出其
%2D灰階圖來說明image及imshow兩種畫影像圖的指令有何不同。進一步在此灰階圖中找一個灰階值來
%置換成某個不一樣的灰階值，觀察置換成功之後的圖來說明灰階值的大小跟黑白的強度有何關係。

im = imread('math3.jpg');
%im宣告為圖檔
bw = im;
%bw(:,:) = im(:,:,1);
%將三維陣列降至二維
bw(im==255) = 1;
%將im中的255用==取代為黑色的1色號
figure,imshow(uint8(bw));
%imshow(uint8(bw))顯示圖片檔並強制轉換為8位元類別

%image能直接顯示出彩色圖片
%imshow為索引灰度影像 需用imread指令將影像讀入矩陣 用函式繪製影像


